※このメールは、登録メールアドレス宛に自動的にお送りしています。
※登録内容をご確認の上、大切に保管してください。返信の必要はありません。

{$data.name} 様、
お問い合わせありがとうございます。

下記内容のお問い合わせ内容をご確認ください。
━━━━━━━━━━━━━━━━━━━━━━━━━━
◆◇お問い合わせ種類◇◆
━━━━━━━━━━━━━━━━━━━━━━━━━━
{$data.subject}

━━━━━━━━━━━━━━━━━━━━━━━━━━
◆◇お問い合わせ内容◇◆
━━━━━━━━━━━━━━━━━━━━━━━━━━
{$data.body}

━━━━━━━━━━━━━━━━━━━━━━━━━━
◆◇好きな飲物◇◆
━━━━━━━━━━━━━━━━━━━━━━━━━━
{implode|$data.drink}

━━━━━━━━━━━━━━━━━━━━━━━━━━
◆◇お客様情報◇◆
━━━━━━━━━━━━━━━━━━━━━━━━━━
氏名：{$data.name} （{$data.furigana}）
Eメール：{$data.email}

━━━━━━━━━━━━━━━━━━━━━━━━━━
受付日時：{$data.date}
━━━━━━━━━━━━━━━━━━━━━━━━━━
