<?php
header('Content-Type: text/html; charset=utf-8');

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// 基本設定
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//このファイルの名前（ファイル名と同じにしてください）

$filename = "sendmail.php";


//このファイルからconfig.phpまでのパス

$configpath = "config.php";


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// フォームからのメールを受け取る人の設定
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//メールアドレス(このメールアドレスにフォームの内容が送信されます。)

$myMail = "";


//送信者名(メールソフトの「送信者」の箇所に表示されます)

$sender = "送信者";


//受信メール件名(メールソフトの「件名」の箇所に表示されます)

$mailTitle = "お問い合わせがありました。";


//受信メール内容のメッセージ("EOF"は消さないでください。)

$mailText = <<<EOF
お問合わせがありました。
EOF;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// フォームからメールを送った人に自動で返信するメールの設定
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//自動返信メール("1" で送信する "0" で送信しない)

$remailflg = 1;


//自動返信メール件名(メールソフトの「件名」の箇所に表示されます)

$remailTitle = "お問い合わせありがとうございました。";


//自動返信メール内容の上段メッセージ("EOF"は消さないでください。)

$remailTop = <<<EOF
お問合わせありがとうございました。
以下の内容が送信されました。
EOF;


//自動返信メール内容の下段メッセージ("EOF"は消さないでください。)

$remailBottom = <<<EOF

EOF;


//署名

$sign = <<<EOF

EOF;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// 確認画面、エラー画面、送信後画面設定
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//確認画面、エラー画面のメッセージ(HTML使用可。"EOF"は消さないでください。)

$explain = <<<EOF
<p>
内容をご確認の上、「送信」ボタンを押してください。<br />
<span style="color: #ff0000;">赤文字</span>が表示されている箇所は入力エラーです。<br />
お手数ですが、入力画面より再度入力してください。
</p>
EOF;


//メール送信の成功メッセージ設定(HTML使用可。"EOF"は消さないでください。)

$thanks = <<<EOF
お問合せメールを送信に成功しました。
EOF;


//メール送信の失敗メッセージ設定(HTML使用可。"EOF"は消さないでください。)

$errorMsg = <<<EOF
送信に失敗しました。<br />
お手数ですが、入力画面より再度入力をお願いいたします。
EOF;


//エラー内容のテキストカラー

$color = "#ff0000";


//必須項目エラーのテキスト

$absErr = "必須項目です。入力してください。";


//入力エラーのテキスト

$inputErr = "入力が正しくありません。";


//メールアドレス不一致エラーのテキスト

$mailErr = "メールアドレスが一致していません。";


//半角数字入力エラーのテキスト

$fontErr = "半角数字で入力してください。";


//エラー画面の戻るボタン

$errorBtn = <<<EOF
<input type='button' value='入力画面に戻る' alt='入力画面に戻る' onclick='history.back()' />
EOF;


//メール確認画面のボタン

$confirmBtn = <<<EOF
<input type='button' value='入力画面に戻る' alt='入力画面に戻る' onclick='history.back()' />　<input type='submit' name='submit' value='送信' />
EOF;


//メール送信後画面のボタン

$returnBtn = <<<EOF
<input type='submit' value='トップに戻る' alt='入力画面に戻る' />
EOF;


//メール送信後画面のボタンのリンク先(初期設定はメール入力画面)

$returnPath = "form.html";


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
require $configpath; //消さないで！！


//テンプレートタグの設定(カンマ区切りで複数指定してください。)

$post = array(

"お名前" => name("姓","名","true"),

"フリガナ" => name("フリガナ1","フリガナ2","true"),

"性別" => output("性別","true"),

"郵便番号" => postcode("郵便番号1","郵便番号2","false"),

"住所" => output("住所","false"),

"電話番号" => tel("電話番号1","電話番号2","電話番号3","false"),

"メールアドレス" => mailAdd("メール","メール確認","true"),

"メールアドレス(確認)" => mailAdd("メール確認","メール","true"),

"お問い合わせ内容" => output("お問い合わせ内容","true"),

);


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// テンプレートタグ一覧（コピーして$postに追加してください。また、name値はinputの設定に応じてに変更してください。）
//
//　　"テキスト、セレクト、ラジオボタンなど" => output("name値","false","テキスト","テキスト"),
//
//    "お名前" => name("姓","名","true"),
//
//    "生年月日" => birthday("年","月","日","false","西暦"),
//
//    "郵便番号" => postcode("郵便番号1","郵便番号2","false"),
//
//    "電話番号" => tel("電話番号1","電話番号2","電話番号3","false"),
//
//    "メールアドレス(確認なし)" => mailAdd("メール","true"),
//
//    "メールアドレス(確認あり)" => mailAdd("メール","メール確認","true"),
//
//    "メールアドレス(確認用)" => mailAdd("メール確認","メール","true"),
//
//    "チェックボックス" => checkBox("name値","区切り文字","false"),
//
//    "input連結用(2個)" => connect("name値1","name値2","false","テキスト","テキスト","テキスト"),
//
//    "input連結用(3個)" => multi("name値1","name値2","name値3","false","テキスト","テキスト","テキスト","テキスト"),
//
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// 確認画面、エラー画面について
//
//    メール確認画面テンプレートの表示は以下のようにtableレイアウトになっています。
//
//    <table>
//    <tr>
//    <th>項目名</th>
//    <td>入力内容</td>
//    </tr>
//    </table>
//
//   「confirm.php」の中に記述されていますので、必要がある場合は変更してください。
//
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


require "confirm.php"; 
?>



